'use strict';
// задача 1
// let x = 5; alert( x++ );
// врнет в браузере 5 так как запись постфиксная

 // ex2
//  [ ] + false - null + true
// console.log([] + false - null + true); 
// Особенность. когда мы работает с путым массивом в таких операциях, он будет приведен к строковому типу данных, а именно у пустой строке.
// Ответ: NaN

// ex 3
// let y = 1;
// let x = y = 2;
// alert(x);
// Ответ 2

// ex 4
// console.log([] + 1 + 2);
// Ответ 12

// ex5 
// alert ('1'[0]);
// Ответ 1

// ex6 
