'use strict';
// задача 1
// let x = 5; alert( x++ );
// врнет в браузере 5 так как запись постфиксная

 // ex2
//  [ ] + false - null + true
// console.log([] + false - null + true); 
// Особенность. когда мы работает с путым массивом в таких операциях, он будет приведен к строковому типу данных, а именно у пустой строке.
// Ответ: NaN

// ex 3
// let y = 1;
// let x = y = 2;
// alert(x);
// Ответ 2

// ex 4
// console.log([] + 1 + 2);
// Ответ 12

// ex5 
// alert ('1'[0]);
// Ответ 1

// ex6 
// console.log(2 && 1 && null && 0 && undefined);
// Ответ null

// ex 7
// console.log(!!( 1 && 2) === (1 && 2));
// Ответ false Два !! возращают нам булиновое значение

// ex 8 
// alert(null || 2 && 3 || 4);
// Ответ 3

// ex 9
// const a = [1, 2, 3];
// const b = [1, 2, 3];
// console.log(a == b);
// Ответ они не равны так как эти переменные разные,

// ex 10
// alert(+"Infinity");
// Ответ Infinity (числовой тпи данных number])

// ex 11
// console.log("Ёжик">"яблоко");
// Сравнение идет по симовльно необходимо открыть таблицу с символома uniCode b и посмотреть кто на каких местах находится 
 
// ex 12
// console.log(0 || "" || 2 || undefined || true || false);
// Ответ 2
